In [138]:
import pandas as pd

In [139]:
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [140]:
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

In [141]:
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [142]:
#District Summary
school_data_complete.head(-1)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39164,39164,Joseph Anthony,M,9th,Thomas High School,97,76,14,Charter,1635,1043130
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130

In [143]:
all_schools = school_data_complete["school_name"].value_counts()
total_schools = all_schools.count()
total_schools

15

In [144]:
total_students = school_data_complete["student_name"].count()
total_students

39170

In [145]:
budget_df = school_data_complete.filter(['school_name', 'budget'])
budget_df.head(-1)

              school_name   budget
0       Huang High School  1910635
1       Huang High School  1910635
2       Huang High School  1910635
3       Huang High School  1910635
4       Huang High School  1910635
...                   ...      ...
39164  Thomas High School  1043130
39165  Thomas High School  1043130
39166  Thomas High School  1043130
39167  Thomas High School  1043130
39168  Thomas High School  1043130

[39169 rows x 2 columns]

In [146]:
working_budget_df = budget_df.drop_duplicates(subset = "school_name", keep = 'first', inplace = True)

In [147]:
total_budget = budget_df["budget"].sum()
total_budget.astype("float")
total_budget

24649428

In [148]:
#print(type(total_budget)) #data type is int here, change to float

In [149]:
avg_math = round((school_data_complete["math_score"].mean()), 2)
avg_math

78.99

In [150]:
avg_reading = round((school_data_complete["reading_score"].mean()), 2)
avg_reading

81.88

In [151]:
num_pass_math = school_data_complete.loc[(school_data_complete["math_score"] >= 70)]
percent_pass_math = round((num_pass_math["math_score"].count() / total_students * 100), 2)
percent_pass_math

74.98

In [152]:
num_pass_reading = school_data_complete.loc[(school_data_complete["reading_score"] >= 70)]
percent_pass_reading = round((num_pass_reading["reading_score"].count() / total_students * 100), 2)
percent_pass_reading

85.81

In [153]:
num_pass_mr = school_data_complete.loc[(school_data_complete["math_score"] >= 70) & (school_data_complete["reading_score"] >= 70)]
percent_pass_mr = round((num_pass_mr["student_name"].count() / total_students * 100), 2)
percent_pass_mr

65.17

In [154]:
district_data = {'Total Schools': [total_schools], 'Total Students': [total_students],'Total Budget': [total_budget], 
                'Average Math Score': [avg_math], 'Average Reading Score': [avg_reading], '% Passing Math': [percent_pass_math], 
                '% Passing Reading': [percent_pass_reading], '% Overall Passing': [percent_pass_mr]}

In [155]:
district_df = pd.DataFrame(district_data)
district_df["Total Budget"] = district_df["Total Budget"].astype("float").map('${:,.2f}'.format)
district_df["Total Students"] = district_df["Total Students"].astype("int").map('{:,}'.format)

In [156]:
#District Summary
district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.99,81.88,74.98,85.81,65.17

In [163]:
#School Summary

In [165]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [170]:
school_data_complete.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [184]:
reduced_school_df = school_data_complete.loc[:, ["school_name", "student_name", "reading_score", "math_score", "type", "size", "budget"]] 
reduced_school_df

,school_name,student_name,reading_score,math_score,type,size,budget
0,Huang High School,Paul Bradley,66,79,District,2917,1910635
1,Huang High School,Victor Smith,94,61,District,2917,1910635
2,Huang High School,Kevin Rodriguez,90,60,District,2917,1910635
3,Huang High School,Dr. Richard Scott,67,58,District,2917,1910635
4,Huang High School,Bonnie Ray,97,84,District,2917,1910635
...,...,...,...,...,...,...,...
39165,Thomas High School,Donna Howard,99,90,Charter,1635,1043130
39166,Thomas High School,Dawn Bell,95,70,Charter,1635,1043130
39167,Thomas High School,Rebecca Tanner,73,84,Charter,1635,1043130
39168,Thomas High School,Desiree Kidd,99,90,Charter,1635,1043130
39169,Thomas High School,Carolyn Jackson,95,75,Charter,1635,1043130

In [244]:
# school_index_df = school_data.set_index('school_name')
# school_index_df.sort_index() 

school_data.head()
new_school_data = school_data[["school_name", "type", "size", "budget"]]
new_school_data["per student budget"] = new_school_data["budget"] / new_school_data["size"] 
group_schools = reduced_school_df.groupby("school_name")
avg_math_scores = group_schools["math_score"].mean().values
new_school_data["average math score"] = avg_math_scores
avg_reading_scores = group_schools["reading_score"].mean().values
new_school_data["average reading score"] = avg_reading_scores
#Calc percent passed math per school
tot_students_ps = group_schools["student_name"].count()
perc_pass_math = num_pass_math.groupby('school_name')
perc_students_pass_m = perc_pass_math['student_name'].count() / tot_students_ps * 100
new_school_data["% passing math"] = perc_students_pass_m
new_school_data.head()

,school_name,type,size,budget,per student budget,average math score,average reading score,% passing math
0,Huang High School,District,2917,1910635,655.0,77.048432,81.033963,NaN
1,Figueroa High School,District,2949,1884411,639.0,83.061895,83.975780,NaN
2,Shelton High School,Charter,1761,1056600,600.0,76.711767,81.158020,NaN
3,Hernandez High School,District,4635,3022020,652.0,77.102592,80.746258,NaN
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,NaN